app/views/admin/items/edit.html.erb

    <%= f.text_field :introduction %>
    <%= f.select :genre_id, Genre.all.map { |genre| [genre.name, genre.id] } %>
---
SELECT "genres".* FROM "genres"