app/controllers/admin/genres_controller.rb

  def index
    @genre_new = Genre.new
    @genres = Genre.all
---
SELECT "genres".* FROM "genres"

  def create
    @genre_new =  Genre.new(genre_params)
    if @genre_new.save
---
INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "ケーキ"], ["created_at", "2022-01-23 03:44:06.233502"], ["updated_at", "2022-01-23 03:44:06.233502"]]