app/controllers/admin/items_controller.rb

  def create
    @item_new = Item.new(item_params)
    if @item_new.save
---
INSERT INTO "items" ("genre_id", "name", "introduction", "is_active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["genre_id", 2], ["name", "栗饅頭"], ["introduction", "栗の入った饅頭"], ["is_active", "t"], ["created_at", "2022-01-23 08:31:28.829255"], ["updated_at", "2022-01-23 08:31:28.829255"]]

  def update
    @item = Item.find(params[:id])
    if @item.update(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "genre_id" = ?, "price" = ?, "is_active" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["genre_id", 1], ["price", 1000], ["is_active", "t"], ["updated_at", "2022-01-23 08:33:32.397518"], ["id", 1]]