app/controllers/public/addresses_controller.rb

  def index
    @address_new = Address.new
    @addresses = Address.all
---
SELECT "addresses".* FROM "addresses"

  def create
    @address_new = Address.new(address_params)
    @address_new.customer_id = current_customer.id
    if @address_new.save
---
INSERT INTO "addresses" ("customer_id", "name", "postal_code", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["customer_id", 1], ["name", "佐藤"], ["postal_code", "5600000"], ["address", "大阪府"], ["created_at", "2022-01-23 09:53:26.665004"], ["updated_at", "2022-01-23 09:53:26.665004"]]

  def update
    @address = Address.find(params[:id])
    if @address.update(address_params)
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "addresses" SET "address" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["address", "大阪府大阪市"], ["updated_at", "2022-01-23 10:00:48.582659"], ["id", 2]]

  def destroy
    address = Address.find(params[:id])
    address.destroy
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "addresses" WHERE "addresses"."id" = ?  [["id", 1]]