app/controllers/public/cart_items_controller.rb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
---
  def index

    @cart_items = CartItem.where(customer_id: current_customer.id)

INSERT INTO "cart_items" ("item_id", "customer_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["item_id", 1], ["customer_id", 1], ["amount", 1], ["created_at", "2022-01-23 10:54:08.926855"], ["updated_at", "2022-01-23 10:54:08.926855"]]
---
  def create
    cart_item_new = CartItem.new(cart_item_params)
    cart_item_new.customer_id = current_customer.id
    cart_item_new.save