app/controllers/public/customers_controller.rb

UPDATE "customers" SET "last_name" = ?, "last_name_kana" = ?, "first_name" = ?, "first_name_kana" = ?, "postal_code" = ?, "address" = ?, "telephone_number" = ?, "updated_at" = ? WHERE "customers"."id" = ?
---
  def update
    @customer = current_customer
    if @customer.update(customer_params)